In [10]:
import pandas as pd

data = {"이름": [ "철수", "영희", "민수", "지영"],
        "나이": [ 25,  30, 22, 28],
        "성별": ["남자", "여자", "남자", "여자"] }
frame = pd.DataFrame(data)
frame

   이름  나이  성별
0  철수  25  남자
1  영희  30  여자
2  민수  22  남자
3  지영  28  여자

In [16]:
import pandas as pd

data1 = {"col1": [ "a", "b", "c"],
        "col2": [ 1, 2, 3]}
frame1 = pd.DataFrame(data1)
#frame1
frame1.loc[:2, 'col1':'col2']
frame1

  col1  col2
0    a     1
1    b     2
2    c     3

In [25]:
import pandas as pd

data1 = {"col1": [ "a", "b", "c"],
        "col2": [ 1, 2, 3]}
df1 = pd.DataFrame(data1)
data2 = {"col3" : [ "a", "b", "f"],
         "col4" : [ 10, 20, 30]}
df2 = pd.DataFrame(data2)
df3 = pd.merge(df1, df2, left_on='col1', right_on='col3', how = "outer")
df3

  col1  col2 col3  col4
0    a   1.0    a  10.0
1    b   2.0    b  20.0
2    c   3.0  NaN   NaN
3  NaN   NaN    f  30.0